20211015154923-capstone_scrum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>capstone-scrum</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">capstone-scrum</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6b1cdeb">STRT Sprint 1: Set up the open-ended road simulation system <code>[0/7]</code></a></li>
<li><a href="#org204eb23"><span class="todo TODO">TODO</span> Sprint 2: Evaluate the function and performance index of VEOS through the simulation platform <code>[0/5]</code></a></li>
<li><a href="#org0e85baf"><span class="todo TODO">TODO</span> Sprint 3: Propose improvement of VEOS based on the simulation results. <code>[0/3]</code></a></li>
<li><a href="#org0bc3fdc"><span class="todo TODO">TODO</span> Review and Submit <code>[0/2]</code></a></li>
<li><a href="#org279332c">Team</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6b1cdeb" class="outline-2">
<h2 id="org6b1cdeb">STRT Sprint 1: Set up the open-ended road simulation system <code>[0/7]</code></h2>
<div class="outline-text-2" id="text-org6b1cdeb">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Generate road network with randomly sampled curvature and connection topology</li>
<li class="off"><code>[&#xa0;]</code> Generate Non-Player-Character object vehicles with pre-programmed motion trajectories</li>
<li class="off"><code>[&#xa0;]</code> Generate autonmous driving object vehicles with pre-trained baseline reinforcement learning agents</li>
<li class="off"><code>[&#xa0;]</code> Spawn object vehicles on the map</li>
<li class="off"><code>[&#xa0;]</code> Spawn ego vehicles with VEOS</li>
<li class="off"><code>[&#xa0;]</code> Investigate Vehicle Model</li>
<li class="off"><code>[&#xa0;]</code> Implement the longitudinal and lateral PID controller in PGDrive (ref. Coursera Course Motion Planning for Self-Driving Cars)</li>
</ul>
</div>
</div>
<div id="outline-container-org204eb23" class="outline-2">
<h2 id="org204eb23"><span class="todo TODO">TODO</span> Sprint 2: Evaluate the function and performance index of VEOS through the simulation platform <code>[0/5]</code></h2>
<div class="outline-text-2" id="text-org204eb23">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Implement the DDPG &amp; RDPG agent for VEOS system</li>
<li class="off"><code>[&#xa0;]</code> Evaluate the generalization capability of VEOS under diverse road conditions</li>
<li class="off"><code>[&#xa0;]</code> Collect data through simulation platform and train the VEOS system</li>
<li class="off"><code>[&#xa0;]</code> Evaluate the safety property for vehicles with VEOS, for example crash, traffic rules impediments</li>
<li class="off"><code>[&#xa0;]</code> Evaluate the competetive and cooperative behavior of the multi-agent system sharing the same VEOS strategy</li>
</ul>
</div>
</div>
<div id="outline-container-org0e85baf" class="outline-2">
<h2 id="org0e85baf"><span class="todo TODO">TODO</span> Sprint 3: Propose improvement of VEOS based on the simulation results. <code>[0/3]</code></h2>
<div class="outline-text-2" id="text-org0e85baf">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> collect and analyse the simulation data</li>
<li class="off"><code>[&#xa0;]</code> collect some actual road test result and compare them with simulation results.</li>
<li class="off"><code>[&#xa0;]</code> Implement the improvement proposals in the simulation platform by retrain the veos system with validation.</li>
</ul>
</div>
</div>
<div id="outline-container-org0bc3fdc" class="outline-2">
<h2 id="org0bc3fdc"><span class="todo TODO">TODO</span> Review and Submit <code>[0/2]</code></h2>
<div class="outline-text-2" id="text-org0bc3fdc">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Code consolidation/Review</li>
<li class="off"><code>[&#xa0;]</code> Final Report/Presentation</li>
</ul>
</div>
</div>

<div id="outline-container-org279332c" class="outline-2">
<h2 id="org279332c">Team</h2>
<div class="outline-text-2" id="text-org279332c">
<ul class="org-ul">
<li><b><b>徐亦航 momo<sub>byh</sub>@sjtu.edu.cn</b></b></li>
<li>陆东昀 ludongyun0722@sjtu.edu.cn</li>
<li>张思远 zhangsiyuan0518@sjtu.edu.cn</li>
<li>方寒 han.fang@sjtu.edu.cn</li>
<li>许泽恒 15000956679@sjtu.edu.cn</li>
<li>潘泓辰 hongchen.pan@newrizon.com</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.7)</p>
</div>
</body>
</html>